# My Decision Trees Project

## Step 1: Import the Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Experiment with pd.get_dummies

In [2]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70],
        'Sex': ['m','f', 'f', 'm', 'f']}
testdata = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore', 'Sex'])
testdata

  first_name last_name  age  preTestScore  postTestScore Sex
0      Jason    Miller   42             4             25   m
1      Molly  Jacobson   52            24             94   f
2       Tina       Ali   36            31             57   f
3       Jake    Milner   24             2             62   m
4        Amy     Cooze   73             3             70   f

In [6]:
kolom = ['Sex'] #Deze kolom moet dus ook echt in de dataset voorkomen, anders krijg je een foutmelding

In [7]:
kolom

['Sex']

In [8]:
final_data = pd.get_dummies(testdata,columns=kolom,drop_first=False)
# pd.get_dummies in deze vorm kijkt naar de list kolom. Deze is "Sex" en komt overeen met de kolom sex in de dataset. 
# vervolgens kijkt het algoritme welke categorische waarden er in deze kolom zitten. Vervangt ze door 0 of 1 en specificeert
# dit door een Sex_f en Sex_m kolom aan te maken en daar deze catagorische waarde in te plaatsen
# Als drop_first op True zou staan zou hij de eerste kolom Sex_f droppen
# Dit kan in dit geval omdat als de Sex_f een 0 is Sex_m automatische een 1 moet zijn. Sex_f of Sex_m is dan overbodig

In [19]:
final_data

  first_name last_name  age  preTestScore  postTestScore  Sex_f  Sex_m
0      Jason    Miller   42             4             25      0      1
1      Molly  Jacobson   52            24             94      1      0
2       Tina       Ali   36            31             57      1      0
3       Jake    Milner   24             2             62      0      1
4        Amy     Cooze   73             3             70      1      0

In [9]:
final_data = pd.get_dummies(testdata,columns=kolom,drop_first=True)

In [10]:
final_data

  first_name last_name  age  preTestScore  postTestScore  Sex_m
0      Jason    Miller   42             4             25      1
1      Molly  Jacobson   52            24             94      0
2       Tina       Ali   36            31             57      0
3       Jake    Milner   24             2             62      1
4        Amy     Cooze   73             3             70      0